Revit 2024 API
BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElement Property
 Can't keep reference of joined element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotKeepReferenceOfJoinedElement { get; }
Visual Basic
Public Shared ReadOnly Property CannotKeepReferenceOfJoinedElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotKeepReferenceOfJoinedElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace